

public class Main {
            // Операторы if-else
            // Базовые упражнения
    // Проверка четности числа: Напишите программу, которая принимает целое число и проверяет, является ли оно четным или нечетным.
    public void ex1(int n)
    {
 
     if( n % 2 == 0)
     {
 System.out.println("Число чёткое");
     }
    else
    {
     System.out.println("Нечёткое");
    }
}

    public static void main(String[] args)
    {
       
        int a = 5;      
        int d = 0;
        Main obj = new Main();
        obj.ex1(a);




        
        
        
       
        
        
        

        
        
    
        

   }
   
  
}



