

public class Main {
 
    public static void main(String[] args)
    {
        System.out.println(MathOperations.recursion(5));

    // Напишите рекурсивный метод для вычисления факториала числа в классе MathOperations.
    }

   
}



